# **Setup**

* https://www.youtube.com/watch?v=eMOA1pPVUc4

In [62]:
import pandas as pd 
import numpy as np

# **Task 01**

* Read & Merge All Monthly Data Files Into A Dataframe

In [63]:
# Sample File
df = pd.read_csv('Input Data/Sales Analysis/Sales_Data/Sales_April_2019.csv')

print(df.shape)
df.head()

(18383, 6)

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,176558,USB-C Charging Cable,2,11.95,04/19/19 08:46,"917 1st St, Dallas, TX 75001"
1,NaN,NaN,NaN,NaN,NaN,NaN
2,176559,Bose SoundSport Headphones,1,99.99,04/07/19 22:30,"682 Chestnut St, Boston, MA 02215"
3,176560,Google Phone,1,600,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"
4,176560,Wired Headphones,1,11.99,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"

In [64]:
# Get List Of All Data Files
import os
File_List = os.listdir('Input Data/Sales Analysis/Sales_Data')

print('No. Of Files: ',len(File_List))
File_List

No. Of Files:  12

['Sales_April_2019.csv',
 'Sales_August_2019.csv',
 'Sales_December_2019.csv',
 'Sales_February_2019.csv',
 'Sales_January_2019.csv',
 'Sales_July_2019.csv',
 'Sales_June_2019.csv',
 'Sales_March_2019.csv',
 'Sales_May_2019.csv',
 'Sales_November_2019.csv',
 'Sales_October_2019.csv',
 'Sales_September_2019.csv']

In [65]:
# Create Empty Dataframe
df = pd.DataFrame()
print('Initial Dataframe Shape: ',df.shape,'\n')

# Read & Merge All Files
Folder_Path = 'Input Data/Sales Analysis/Sales_Data' 

for file in File_List:
    print(f'Reading File: {file}!')
    File_Path = Folder_Path + '/' + file
    if df.shape == (0,0):
        df = pd.read_csv(File_Path)
        print('Dataframe Shape: ',df.shape,'\n')
    else:
        df_new = pd.read_csv(File_Path) 
        if df.shape[1] == df_new.shape[1]:
            df = pd.concat([df,df_new],axis=0)
            print('Dataframe Shape: ',df.shape,'\n')
        else:
            print('File Shape Mismatch !')

Initial Dataframe Shape:  (0, 0)

Reading File: Sales_April_2019.csv!
Dataframe Shape:  (18383, 6)

Reading File: Sales_August_2019.csv!
Dataframe Shape:  (30394, 6)

Reading File: Sales_December_2019.csv!
Dataframe Shape:  (55511, 6)

Reading File: Sales_February_2019.csv!
Dataframe Shape:  (67547, 6)

Reading File: Sales_January_2019.csv!
Dataframe Shape:  (77270, 6)

Reading File: Sales_July_2019.csv!
Dataframe Shape:  (91641, 6)

Reading File: Sales_June_2019.csv!
Dataframe Shape:  (105263, 6)

Reading File: Sales_March_2019.csv!
Dataframe Shape:  (120489, 6)

Reading File: Sales_May_2019.csv!
Dataframe Shape:  (137124, 6)

Reading File: Sales_November_2019.csv!
Dataframe Shape:  (154785, 6)

Reading File: Sales_October_2019.csv!
Dataframe Shape:  (175164, 6)

Reading File: Sales_September_2019.csv!
Dataframe Shape:  (186850, 6)

In [66]:
# Export The New Dataframe To CSV
df.to_csv('Merged_Monthly_Data.csv',index=False)

In [67]:
df.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,176558,USB-C Charging Cable,2,11.95,04/19/19 08:46,"917 1st St, Dallas, TX 75001"
1,NaN,NaN,NaN,NaN,NaN,NaN
2,176559,Bose SoundSport Headphones,1,99.99,04/07/19 22:30,"682 Chestnut St, Boston, MA 02215"
3,176560,Google Phone,1,600,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"
4,176560,Wired Headphones,1,11.99,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"

In [68]:
df_01 = pd.read_csv('Merged_Monthly_Data.csv')
df_01.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,176558,USB-C Charging Cable,2,11.95,04/19/19 08:46,"917 1st St, Dallas, TX 75001"
1,NaN,NaN,NaN,NaN,NaN,NaN
2,176559,Bose SoundSport Headphones,1,99.99,04/07/19 22:30,"682 Chestnut St, Boston, MA 02215"
3,176560,Google Phone,1,600,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"
4,176560,Wired Headphones,1,11.99,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"

## **Data Cleaning**

In [69]:
# Check For Missing Values
df.isna().sum()

Order ID            545
Product             545
Quantity Ordered    545
Price Each          545
Order Date          545
Purchase Address    545
dtype: int64

In [70]:
df[df.isna().any(axis=1)]

      Order ID Product Quantity Ordered Price Each Order Date Purchase Address
1          NaN     NaN              NaN        NaN        NaN              NaN
356        NaN     NaN              NaN        NaN        NaN              NaN
735        NaN     NaN              NaN        NaN        NaN              NaN
1433       NaN     NaN              NaN        NaN        NaN              NaN
1553       NaN     NaN              NaN        NaN        NaN              NaN
...        ...     ...              ...        ...        ...              ...
10012      NaN     NaN              NaN        NaN        NaN              NaN
10274      NaN     NaN              NaN        NaN        NaN              NaN
10878      NaN     NaN              NaN        NaN        NaN              NaN
11384      NaN     NaN              NaN        NaN        NaN              NaN
11662      NaN     NaN              NaN        NaN        NaN              NaN

[545 rows x 6 columns]

In [71]:
print('Dataframe Shape Before: ',df.shape)

# Drop NA Values
df.dropna(how='all',inplace=True)
print('Dataframe Shape After: ',df.shape)

Dataframe Shape Before:  (186850, 6)
Dataframe Shape After:  (186305, 6)

In [72]:
df[df.isna().any(axis=1)]

Empty DataFrame
Columns: [Order ID, Product, Quantity Ordered, Price Each, Order Date, Purchase Address]
Index: []

In [60]:
print('Dataframe Shape Before: ',df.shape)

# Drop Duplicates
df.drop_duplicates(inplace=True)
print('Dataframe Shape After: ',df.shape)

Dataframe Shape Before:  (186305, 6)
Dataframe Shape After:  (185687, 6)

In [61]:
df.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,176558,USB-C Charging Cable,2,11.95,04/19/19 08:46,"917 1st St, Dallas, TX 75001"
2,176559,Bose SoundSport Headphones,1,99.99,04/07/19 22:30,"682 Chestnut St, Boston, MA 02215"
3,176560,Google Phone,1,600,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"
4,176560,Wired Headphones,1,11.99,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"
5,176561,Wired Headphones,1,11.99,04/30/19 09:27,"333 8th St, Los Angeles, CA 90001"

# **Task 02**

* What was the best month for sales?
* How much was earned that month ?